In [2]:
import pandas as pd
import json

In [2]:
data = pd.read_json('./user-item-interaction.json')

data.to_csv('./user-item-interaction.csv')

In [3]:
df = pd.read_csv('./user-item-interaction.csv')

In [5]:
df.head(10)

,Unnamed: 0,USER_ID,ITEM_ID,TIMESTAMP,USER_LOGIN,LOCATION
0,0,298,474,1998-01-07 14:20:06,booker12,Fengping
1,1,253,465,1998-04-03 18:34:27,grey07,Jembe Timur
2,2,286,1014,1997-11-17 15:38:45,johnson81,Schiltigheim
3,3,200,222,1997-10-05 09:05:40,jenkins46,Karawatung
4,4,122,387,1997-11-11 17:47:39,smith79,Bicurga
5,5,291,1042,1997-09-21 09:42:24,avose0,Nonggunong
6,6,119,392,1998-01-30 16:13:34,tlandon1,Moosomin
7,7,167,486,1998-04-16 14:54:12,kkynoch2,Temizhbekskaya
8,8,299,144,1997-10-26 15:55:20,wlongbone3,Gardutanjak
9,9,308,1,1998-02-17 17:28:52,dparkyn4,Sanguanzhai

In [6]:
df.drop(['Unnamed: 0'], axis = 1, inplace = True)

In [8]:
df

       USER_ID  ITEM_ID            TIMESTAMP    USER_LOGIN         LOCATION
0          298      474  1998-01-07 14:20:06      booker12         Fengping
1          253      465  1998-04-03 18:34:27        grey07      Jembe Timur
2          286     1014  1997-11-17 15:38:45     johnson81     Schiltigheim
3          200      222  1997-10-05 09:05:40     jenkins46       Karawatung
4          122      387  1997-11-11 17:47:39       smith79          Bicurga
...        ...      ...                  ...           ...              ...
55370      421      498  1998-04-10 20:49:04    hpendall9y  Moissy-Cramayel
55371      495     1091  1998-02-28 03:45:03    hjarnell9z      Montb�liard
55372      806      421  1997-12-17 20:01:37  rwoodrougha0             Zeya
55373      676      538  1998-04-16 00:10:37    bfitzroya1         Victoria
55374      716      204  1997-11-17 19:39:03     emunnisa2       Chai Badan

[55375 rows x 5 columns]

In [11]:
df.drop(['USER_LOGIN', 'LOCATION'], axis = 1, inplace = True)

In [12]:
df

       USER_ID  ITEM_ID            TIMESTAMP
0          298      474  1998-01-07 14:20:06
1          253      465  1998-04-03 18:34:27
2          286     1014  1997-11-17 15:38:45
3          200      222  1997-10-05 09:05:40
4          122      387  1997-11-11 17:47:39
...        ...      ...                  ...
55370      421      498  1998-04-10 20:49:04
55371      495     1091  1998-02-28 03:45:03
55372      806      421  1997-12-17 20:01:37
55373      676      538  1998-04-16 00:10:37
55374      716      204  1997-11-17 19:39:03

[55375 rows x 3 columns]

In [13]:
df.to_csv('./user-item-interaction.csv', index='USER_ID')

In [4]:
df = pd.read_csv('./user-item-interaction.csv')
df.head

<bound method NDFrame.head of        Unnamed: 0  USER_ID  ITEM_ID            TIMESTAMP
0               0      298      474  1998-01-07 14:20:06
1               1      253      465  1998-04-03 18:34:27
2               2      286     1014  1997-11-17 15:38:45
3               3      200      222  1997-10-05 09:05:40
4               4      122      387  1997-11-11 17:47:39
...           ...      ...      ...                  ...
55370       55370      421      498  1998-04-10 20:49:04
55371       55371      495     1091  1998-02-28 03:45:03
55372       55372      806      421  1997-12-17 20:01:37
55373       55373      676      538  1998-04-16 00:10:37
55374       55374      716      204  1997-11-17 19:39:03

[55375 rows x 4 columns]>

In [6]:
data = pd.read_json('./user-item-interaction.json')

data = pd.read_json('./user-item-interaction.json', convert_dates=False) 

data

       USER_ID  ITEM_ID  TIMESTAMP    USER_LOGIN         LOCATION
0          298      474  884182806      booker12         Fengping
1          253      465  891628467        grey07      Jembe Timur
2          286     1014  879781125     johnson81     Schiltigheim
3          200      222  876042340     jenkins46       Karawatung
4          122      387  879270459       smith79          Bicurga
...        ...      ...        ...           ...              ...
55370      421      498  892241344    hpendall9y  Moissy-Cramayel
55371      495     1091  888637503    hjarnell9z      Montb�liard
55372      806      421  882388897  rwoodrougha0             Zeya
55373      676      538  892685437    bfitzroya1         Victoria
55374      716      204  879795543     emunnisa2       Chai Badan

[55375 rows x 5 columns]

In [7]:
data.drop(['USER_LOGIN', 'LOCATION'], axis = 1, inplace = True)

In [8]:
data

       USER_ID  ITEM_ID  TIMESTAMP
0          298      474  884182806
1          253      465  891628467
2          286     1014  879781125
3          200      222  876042340
4          122      387  879270459
...        ...      ...        ...
55370      421      498  892241344
55371      495     1091  888637503
55372      806      421  882388897
55373      676      538  892685437
55374      716      204  879795543

[55375 rows x 3 columns]

In [9]:
data.to_csv('./user-item-interaction.csv', index='USER_ID')

In [3]:
data = pd.read_csv('../data/user-item-interaction.csv')

In [7]:
data

         order_id  user_id  product_id
0         1187899        1       196.0
1         1187899        1     25133.0
2         1187899        1     38928.0
3         1187899        1     26405.0
4         1187899        1     39657.0
...           ...      ...         ...
1384612    272231   206209     40603.0
1384613    272231   206209     15655.0
1384614    272231   206209     42606.0
1384615    272231   206209     37966.0
1384616    272231   206209     39216.0

[1384617 rows x 3 columns]

In [6]:
data['order_id'].nunique()

131209